Revit 2024 API
DefaultDivideSettings.PathNumber Property
 A default Divided Path number for a fixed number layout.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public int PathNumber { get; set; }
Visual Basic
Public Property PathNumber As Integer
	Get
	Set
Visual C++
public:
property int PathNumber {
	int get ();
	void set (int value);
}
See Also
DefaultDivideSettings Class
Autodesk.Revit.DB Namespace